//=============================================================================
//
// リザルト画面処理 [Result.h]
//
//=============================================================================
#ifndef _RESULT_H_INCLUDE_
#define _RESULT_H_INCLUDE_


#include <Windows.h>


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
